Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectSelector.GetAllObjects Method
 Returns an enumerator of all the model objects in the current model. NOT YET IMPLEMENTED.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObjectEnumerator GetAllObjects(
	string AnalysisModelName
)
Public Function GetAllObjects (
	AnalysisModelName As String
) As AnalysisObjectEnumerator
Parameters
AnalysisModelName
Type: System.String
The name of the analysis model.
Return Value
Type: AnalysisObjectEnumerator
A model object enumerator of all the model objects.
See Also
Reference
AnalysisObjectSelector Class
Tekla.Structures.Analysis Namespace